SOAPe/Templates/EWS/EmptyFolder.xml

<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
          xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages" 
          xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" 
          xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <t:RequestServerVersion Version="Exchange2010_SP1" />
  </soap:Header>
  <soap:Body>
    <m:EmptyFolder DeleteType="<!--FIELD:DeleteType;list;HardDelete,SoftDelete,MoveToDeletedItems-->" DeleteSubFolders="<!--FIELD:DeleteSubFolders;list;true,false-->">
      <m:FolderIds>
        <!--FIELD:FolderId;FolderId-->
      </m:FolderIds>
    </m:EmptyFolder>
  </soap:Body>
</soap:Envelope>